{
    "id": "SS1_23",
    "title": "Supervisory Statement SS1/23: Model Risk Management Principles for Banks",
    "summary": {
        "full_summary": "Preprocessed Summary: SS1/23 - Model Risk Management Principles Purpose of the Document Provides the Prudential Regulation Authority's (PRA) expectations for Model Risk Management (MRM) for UK banks, building societies, and PRA-designated investment firms. Emphasizes treating model risk as a standalone risk discipline. Introduces five principles to guide robust MRM practices across the model lifecycle. Five Principles of MRM Model Identification and Model Risk Classification: Define models clearly to set the scope for MRM. Maintain a comprehensive model inventory with a tiered, risk-based approach to classify models. Identify sources of model risk and model interdependencies. Governance: Boards must promote MRM culture and define model risk appetite. Establish robust governance frameworks, assign accountability (e.g., senior management functions), and create comprehensive policies for consistent application across the organization. Model Development, Implementation, and Use: Develop clear standards for model design, implementation, and performance measurement. Regularly test data, assumptions, and outcomes to identify and address limitations. Ensure alignment between the model's purpose and its use. Independent Model Validation: Establish a validation function to provide independent, ongoing, and effective challenges to model development and use. Validate models regularly and ensure recommendations for remediation are implemented. Model Risk Mitigants: Develop policies to address model limitations, such as post-model adjustments (PMAs). Implement processes for independent review of adjustments and manage significant model deficiencies or performance issues. Place restrictions on model use or escalate exceptions as needed. Key Expectations Firms must conduct initial self-assessments of their MRM frameworks before May 17, 2024, and update them annually. Boards must receive regular updates on MRM practices and remediation progress. Independent validation and periodic revalidation are critical for ongoing model governance. Proportionality Application of MRM principles should be proportionate to the firm's size, complexity, and model use. Special Considerations Include controls for third-party vendor models and parent-group models. Pay attention to data quality, assumptions, and integration with supporting systems. ",
        "sections": [
            {
                "section_title": "Principle 1: Model Identification and Risk Classification",
                "text": "Establish a definition of models, maintain a comprehensive model inventory, and adopt a tiering system to classify models based on risk and complexity."
            },
            {
                "section_title": "Principle 2: Governance",
                "text": "Implement strong governance, including board-level oversight, to promote an MRM culture. Define risk appetite, ensure accountability through senior management functions, and establish clear roles and responsibilities."
            },
            {
                "section_title": "Principle 3: Model Development, Implementation, and Use",
                "text": "Ensure robust model development processes with regular testing of data, assumptions, and performance. Document and validate all aspects of model design and implementation."
            },
            {
                "section_title": "Principle 4: Independent Model Validation",
                "text": "Maintain an independent validation function to provide unbiased reviews of model suitability and effectiveness. Conduct periodic revalidation and ongoing monitoring of model performance."
            },
            {
                "section_title": "Principle 5: Model Risk Mitigants",
                "text": "Develop policies and procedures for post-model adjustments, restrictions on model use, and escalations for significant deficiencies. Ensure mitigants address uncertainties and improve model reliability."
            }
        ]
    },
    "metadata": {
        "author": "Prudential Regulation Authority (PRA)",
        "date": "2023-05-01",
        "source_type": "Regulatory Document",
        "tags": [
            "Model Risk Management",
            "Governance",
            "Validation",
            "Mitigants",
            "PRA"
        ],
        "url": "https://www.bankofengland.co.uk/prudential-regulation/publication/2023/may/model-risk-management-principles-for-banks"
    }
}